Revit 2027 API
LineSegment.StartParameter Property
 Parameter associated with the start point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double StartParameter { get; }
Public ReadOnly Property StartParameter As Double
	Get
public:
property double StartParameter {
	double get ();
}
member StartParameter : float with get
Property Value
Double
See Also
Reference
LineSegment Class
Autodesk.Revit.DB Namespace